alexCajas/esp8266RTOSArduCore/boards.txt
# ==============================================================================
# ESP8266 RTOS SDK Arduino Core - boards.txt
# ==============================================================================

menu.BoardModel=Model
menu.ESPModule=Module
menu.UploadTool=Upload Tool
menu.led=Builtin Led
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.dbg=Debug port
menu.lvl=Debug Level

# ==============================================================================
# 1. GENERIC MODULES (Unrestricted Menus for Custom Hardware)
# ==============================================================================

# --- Generic ESP8266 Module ---
generic.name=Generic ESP8266 Module
generic.build.board=ESP8266_GENERIC
generic.build.mcu=esp8266
generic.build.core=esp8266
generic.build.variant=generic
generic.upload.tool=esptool
generic.upload.maximum_data_size=81920
generic.upload.wait_for_upload_port=true
generic.serial.disableDTR=true
generic.serial.disableRTS=true

generic.menu.xtal.80=80 MHz
generic.menu.xtal.80.build.f_cpu=80000000L
generic.menu.xtal.160=160 MHz
generic.menu.xtal.160.build.f_cpu=160000000L

generic.menu.FlashFreq.40=40MHz
generic.menu.FlashFreq.40.build.flash_freq=40
generic.menu.FlashFreq.80=80MHz
generic.menu.FlashFreq.80.build.flash_freq=80

generic.menu.FlashMode.dout=DOUT (compatible)
generic.menu.FlashMode.dout.build.flash_mode=dout
generic.menu.FlashMode.dio=DIO
generic.menu.FlashMode.dio.build.flash_mode=dio
generic.menu.FlashMode.qio=QIO (fast)
generic.menu.FlashMode.qio.build.flash_mode=qio

generic.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
generic.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
generic.menu.ResetMethod.ck=no dtr (aka ck)
generic.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset

# Debug Level
generic.menu.lvl.None____=None
generic.menu.lvl.None____.build.arduhal_log_level=0
generic.menu.lvl.Error=Error
generic.menu.lvl.Error.build.arduhal_log_level=1
generic.menu.lvl.Warn=Warn
generic.menu.lvl.Warn.build.arduhal_log_level=2
generic.menu.lvl.Info=Info
generic.menu.lvl.Info.build.arduhal_log_level=3
generic.menu.lvl.Debug=Debug
generic.menu.lvl.Debug.build.arduhal_log_level=4
generic.menu.lvl.Verbose=Verbose
generic.menu.lvl.Verbose.build.arduhal_log_level=5

# Flash Size (Full 1MB to 16MB Menu)
generic.menu.eesz.1M=1MB (FS:none OTA:~502KB)
generic.menu.eesz.1M.build.flash_size=1M
generic.menu.eesz.1M.build.flash_size_arg=1MB
generic.menu.eesz.1M.upload.maximum_size=514048

generic.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
generic.menu.eesz.2M.build.flash_size=2M
generic.menu.eesz.2M.build.flash_size_arg=2MB
generic.menu.eesz.2M.upload.maximum_size=1043456

generic.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
generic.menu.eesz.4M.build.flash_size=4M
generic.menu.eesz.4M.build.flash_size_arg=4MB
generic.menu.eesz.4M.upload.maximum_size=1043456

generic.menu.eesz.8M=8MB (FS:none OTA:~1019KB)
generic.menu.eesz.8M.build.flash_size=8M
generic.menu.eesz.8M.build.flash_size_arg=8MB
generic.menu.eesz.8M.upload.maximum_size=1043456

generic.menu.eesz.16M=16MB (FS:none OTA:~1019KB)
generic.menu.eesz.16M.build.flash_size=16M
generic.menu.eesz.16M.build.flash_size_arg=16MB
generic.menu.eesz.16M.upload.maximum_size=1043456

generic.menu.baud.115200=115200
generic.menu.baud.115200.upload.speed=115200
generic.menu.baud.921600=921600
generic.menu.baud.921600.upload.speed=921600

# --- Generic ESP8285 Module (1MB DOUT) ---
esp8285.name=Generic ESP8285 Module
esp8285.build.board=ESP8285_GENERIC
esp8285.build.mcu=esp8266
esp8285.build.core=esp8266
esp8285.build.variant=esp8285
esp8285.upload.tool=esptool
esp8285.upload.speed=115200
esp8285.upload.resetmethod=--before default_reset --after hard_reset
esp8285.build.f_cpu=80000000L
esp8285.build.flash_mode=dout
esp8285.build.flash_freq=40

esp8285.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
esp8285.menu.eesz.1M64.build.flash_size=1M
esp8285.menu.eesz.1M64.build.flash_size_arg=1MB
esp8285.menu.eesz.1M64.upload.maximum_size=481280

esp8285.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
esp8285.menu.eesz.1M128.build.flash_size=1M
esp8285.menu.eesz.1M128.build.flash_size_arg=1MB
esp8285.menu.eesz.1M128.upload.maximum_size=448512

esp8285.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
esp8285.menu.eesz.1M256.build.flash_size=1M
esp8285.menu.eesz.1M256.build.flash_size_arg=1MB
esp8285.menu.eesz.1M256.upload.maximum_size=382976

esp8285.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
esp8285.menu.eesz.1M512.build.flash_size=1M
esp8285.menu.eesz.1M512.build.flash_size_arg=1MB
esp8285.menu.eesz.1M512.upload.maximum_size=251904

esp8285.menu.eesz.1M=1MB (FS:none OTA:~502KB)
esp8285.menu.eesz.1M.build.flash_size=1M
esp8285.menu.eesz.1M.build.flash_size_arg=1MB
esp8285.menu.eesz.1M.upload.maximum_size=514048

esp8285.menu.xtal.80=80 MHz
esp8285.menu.xtal.80.build.f_cpu=80000000L
esp8285.menu.xtal.160=160 MHz
esp8285.menu.xtal.160.build.f_cpu=160000000L

esp8285.menu.lvl.None____=None
esp8285.menu.lvl.None____.build.arduhal_log_level=0
esp8285.menu.lvl.Error=Error
esp8285.menu.lvl.Error.build.arduhal_log_level=1
esp8285.menu.lvl.Warn=Warn
esp8285.menu.lvl.Warn.build.arduhal_log_level=2
esp8285.menu.lvl.Info=Info
esp8285.menu.lvl.Info.build.arduhal_log_level=3
esp8285.menu.lvl.Debug=Debug
esp8285.menu.lvl.Debug.build.arduhal_log_level=4
esp8285.menu.lvl.Verbose=Verbose
esp8285.menu.lvl.Verbose.build.arduhal_log_level=5


# ==============================================================================
# 2. POPULAR 4MB DEVELOPMENT BOARDS
# ==============================================================================

# --- NodeMCU 1.0 (ESP-12E) ---
nodemcu.name=NodeMCU 1.0 (ESP-12E Module)
nodemcu.build.board=ESP8266_NODEMCU
nodemcu.build.mcu=esp8266
nodemcu.build.core=esp8266
nodemcu.build.variant=nodemcu
nodemcu.upload.tool=esptool
nodemcu.upload.speed=115200
nodemcu.upload.resetmethod=--before default_reset --after hard_reset
nodemcu.build.flash_mode=dio
nodemcu.build.flash_freq=40

nodemcu.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
nodemcu.menu.eesz.4M2M.build.flash_size=4M
nodemcu.menu.eesz.4M2M.build.flash_size_arg=4MB
nodemcu.menu.eesz.4M2M.upload.maximum_size=1043456

nodemcu.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
nodemcu.menu.eesz.4M3M.build.flash_size=4M
nodemcu.menu.eesz.4M3M.build.flash_size_arg=4MB
nodemcu.menu.eesz.4M3M.upload.maximum_size=524288

nodemcu.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
nodemcu.menu.eesz.4M1M.build.flash_size=4M
nodemcu.menu.eesz.4M1M.build.flash_size_arg=4MB
nodemcu.menu.eesz.4M1M.upload.maximum_size=1043456

nodemcu.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
nodemcu.menu.eesz.4M.build.flash_size=4M
nodemcu.menu.eesz.4M.build.flash_size_arg=4MB
nodemcu.menu.eesz.4M.upload.maximum_size=1043456

nodemcu.menu.xtal.80=80 MHz
nodemcu.menu.xtal.80.build.f_cpu=80000000L
nodemcu.menu.xtal.160=160 MHz
nodemcu.menu.xtal.160.build.f_cpu=160000000L

nodemcu.menu.lvl.None____=None
nodemcu.menu.lvl.None____.build.arduhal_log_level=0
nodemcu.menu.lvl.Error=Error
nodemcu.menu.lvl.Error.build.arduhal_log_level=1
nodemcu.menu.lvl.Warn=Warn
nodemcu.menu.lvl.Warn.build.arduhal_log_level=2
nodemcu.menu.lvl.Info=Info
nodemcu.menu.lvl.Info.build.arduhal_log_level=3
nodemcu.menu.lvl.Debug=Debug
nodemcu.menu.lvl.Debug.build.arduhal_log_level=4
nodemcu.menu.lvl.Verbose=Verbose
nodemcu.menu.lvl.Verbose.build.arduhal_log_level=5


# --- Wemos D1 Mini ---
d1_mini.name=LOLIN(WEMOS) D1 R2 & mini
d1_mini.build.board=ESP8266_WEMOS_D1MINI
d1_mini.build.mcu=esp8266
d1_mini.build.core=esp8266
d1_mini.build.variant=d1_mini
d1_mini.upload.tool=esptool
d1_mini.upload.speed=921600
d1_mini.upload.resetmethod=--before default_reset --after hard_reset
d1_mini.build.flash_mode=dio
d1_mini.build.flash_freq=40

