alexCajas/esp8266RTOSArduCore/boards.txt
d1_mini.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
d1_mini.menu.eesz.4M2M.build.flash_size=4M
d1_mini.menu.eesz.4M2M.build.flash_size_arg=4MB
d1_mini.menu.eesz.4M2M.upload.maximum_size=1043456

d1_mini.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
d1_mini.menu.eesz.4M3M.build.flash_size=4M
d1_mini.menu.eesz.4M3M.build.flash_size_arg=4MB
d1_mini.menu.eesz.4M3M.upload.maximum_size=524288

d1_mini.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
d1_mini.menu.eesz.4M1M.build.flash_size=4M
d1_mini.menu.eesz.4M1M.build.flash_size_arg=4MB
d1_mini.menu.eesz.4M1M.upload.maximum_size=1043456

d1_mini.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
d1_mini.menu.eesz.4M.build.flash_size=4M
d1_mini.menu.eesz.4M.build.flash_size_arg=4MB
d1_mini.menu.eesz.4M.upload.maximum_size=1043456

d1_mini.menu.xtal.80=80 MHz
d1_mini.menu.xtal.80.build.f_cpu=80000000L
d1_mini.menu.xtal.160=160 MHz
d1_mini.menu.xtal.160.build.f_cpu=160000000L

d1_mini.menu.lvl.None____=None
d1_mini.menu.lvl.None____.build.arduhal_log_level=0
d1_mini.menu.lvl.Error=Error
d1_mini.menu.lvl.Error.build.arduhal_log_level=1
d1_mini.menu.lvl.Warn=Warn
d1_mini.menu.lvl.Warn.build.arduhal_log_level=2
d1_mini.menu.lvl.Info=Info
d1_mini.menu.lvl.Info.build.arduhal_log_level=3
d1_mini.menu.lvl.Debug=Debug
d1_mini.menu.lvl.Debug.build.arduhal_log_level=4
d1_mini.menu.lvl.Verbose=Verbose
d1_mini.menu.lvl.Verbose.build.arduhal_log_level=5


# --- Adafruit Feather HUZZAH ESP8266 ---
adafruit.name=Adafruit Feather HUZZAH ESP8266
adafruit.build.board=ESP8266_ADAFRUIT_HUZZAH
adafruit.build.mcu=esp8266
adafruit.build.core=esp8266
adafruit.build.variant=adafruit
adafruit.upload.tool=esptool
adafruit.upload.speed=115200
adafruit.upload.resetmethod=--before default_reset --after hard_reset
adafruit.build.flash_mode=dio
adafruit.build.flash_freq=40

adafruit.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
adafruit.menu.eesz.4M2M.build.flash_size=4M
adafruit.menu.eesz.4M2M.build.flash_size_arg=4MB
adafruit.menu.eesz.4M2M.upload.maximum_size=1043456

adafruit.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
adafruit.menu.eesz.4M3M.build.flash_size=4M
adafruit.menu.eesz.4M3M.build.flash_size_arg=4MB
adafruit.menu.eesz.4M3M.upload.maximum_size=524288

adafruit.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
adafruit.menu.eesz.4M1M.build.flash_size=4M
adafruit.menu.eesz.4M1M.build.flash_size_arg=4MB
adafruit.menu.eesz.4M1M.upload.maximum_size=1043456

adafruit.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
adafruit.menu.eesz.4M.build.flash_size=4M
adafruit.menu.eesz.4M.build.flash_size_arg=4MB
adafruit.menu.eesz.4M.upload.maximum_size=1043456

adafruit.menu.xtal.80=80 MHz
adafruit.menu.xtal.80.build.f_cpu=80000000L
adafruit.menu.xtal.160=160 MHz
adafruit.menu.xtal.160.build.f_cpu=160000000L

adafruit.menu.lvl.None____=None
adafruit.menu.lvl.None____.build.arduhal_log_level=0
adafruit.menu.lvl.Error=Error
adafruit.menu.lvl.Error.build.arduhal_log_level=1
adafruit.menu.lvl.Warn=Warn
adafruit.menu.lvl.Warn.build.arduhal_log_level=2
adafruit.menu.lvl.Info=Info
adafruit.menu.lvl.Info.build.arduhal_log_level=3
adafruit.menu.lvl.Debug=Debug
adafruit.menu.lvl.Debug.build.arduhal_log_level=4
adafruit.menu.lvl.Verbose=Verbose
adafruit.menu.lvl.Verbose.build.arduhal_log_level=5


# ==============================================================================
# 3. SPECIALIZED & SPECIFIC SIZE BOARDS
# ==============================================================================

# --- SparkFun ESP8266 Thing (512KB) ---
thing.name=SparkFun ESP8266 Thing
thing.build.board=ESP8266_SPARKFUN_THING
thing.build.mcu=esp8266
thing.build.core=esp8266
thing.build.variant=thing
thing.upload.tool=esptool
thing.upload.speed=115200
thing.upload.resetmethod=--before default_reset --after hard_reset
thing.build.flash_mode=dio
thing.build.flash_freq=40

thing.menu.eesz.512K64=512KB (FS:64KB OTA:~214KB)
thing.menu.eesz.512K64.build.flash_size=512K
thing.menu.eesz.512K64.build.flash_size_arg=512KB
thing.menu.eesz.512K64.upload.maximum_size=219136

thing.menu.eesz.512K=512KB (FS:none OTA:~246KB)
thing.menu.eesz.512K.build.flash_size=512K
thing.menu.eesz.512K.build.flash_size_arg=512KB
thing.menu.eesz.512K.upload.maximum_size=251904

thing.menu.xtal.80=80 MHz
thing.menu.xtal.80.build.f_cpu=80000000L
thing.menu.xtal.160=160 MHz
thing.menu.xtal.160.build.f_cpu=160000000L

thing.menu.lvl.None____=None
thing.menu.lvl.None____.build.arduhal_log_level=0
thing.menu.lvl.Error=Error
thing.menu.lvl.Error.build.arduhal_log_level=1
thing.menu.lvl.Warn=Warn
thing.menu.lvl.Warn.build.arduhal_log_level=2
thing.menu.lvl.Info=Info
thing.menu.lvl.Info.build.arduhal_log_level=3
thing.menu.lvl.Debug=Debug
thing.menu.lvl.Debug.build.arduhal_log_level=4
thing.menu.lvl.Verbose=Verbose
thing.menu.lvl.Verbose.build.arduhal_log_level=5


# --- ITEAD Sonoff (1MB DOUT) ---
itead.name=ITEAD Sonoff
itead.build.board=ESP8266_SONOFF
itead.build.mcu=esp8266
itead.build.core=esp8266
itead.build.variant=itead
itead.upload.tool=esptool
itead.upload.speed=115200
itead.upload.resetmethod=--before no_reset --after soft_reset
itead.build.flash_mode=dout
itead.build.flash_freq=40

itead.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
itead.menu.eesz.1M64.build.flash_size=1M
itead.menu.eesz.1M64.build.flash_size_arg=1MB
itead.menu.eesz.1M64.upload.maximum_size=481280

itead.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
itead.menu.eesz.1M128.build.flash_size=1M
itead.menu.eesz.1M128.build.flash_size_arg=1MB
itead.menu.eesz.1M128.upload.maximum_size=448512

itead.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
itead.menu.eesz.1M256.build.flash_size=1M
itead.menu.eesz.1M256.build.flash_size_arg=1MB
itead.menu.eesz.1M256.upload.maximum_size=382976

itead.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
itead.menu.eesz.1M512.build.flash_size=1M
itead.menu.eesz.1M512.build.flash_size_arg=1MB
itead.menu.eesz.1M512.upload.maximum_size=251904

itead.menu.eesz.1M=1MB (FS:none OTA:~502KB)
itead.menu.eesz.1M.build.flash_size=1M
itead.menu.eesz.1M.build.flash_size_arg=1MB
itead.menu.eesz.1M.upload.maximum_size=514048

itead.menu.xtal.80=80 MHz
itead.menu.xtal.80.build.f_cpu=80000000L
itead.menu.xtal.160=160 MHz
itead.menu.xtal.160.build.f_cpu=160000000L

itead.menu.lvl.None____=None
itead.menu.lvl.None____.build.arduhal_log_level=0
itead.menu.lvl.Error=Error
itead.menu.lvl.Error.build.arduhal_log_level=1
itead.menu.lvl.Warn=Warn
itead.menu.lvl.Warn.build.arduhal_log_level=2
itead.menu.lvl.Info=Info
itead.menu.lvl.Info.build.arduhal_log_level=3
itead.menu.lvl.Debug=Debug
itead.menu.lvl.Debug.build.arduhal_log_level=4
itead.menu.lvl.Verbose=Verbose
itead.menu.lvl.Verbose.build.arduhal_log_level=5


# --- WifInfo (1MB) ---
wifinfo.name=WifInfo
wifinfo.build.board=ESP8266_WIFINFO
wifinfo.build.mcu=esp8266
wifinfo.build.core=esp8266
wifinfo.build.variant=wifinfo
wifinfo.upload.tool=esptool
wifinfo.upload.speed=115200
wifinfo.upload.resetmethod=--before default_reset --after hard_reset
wifinfo.build.flash_mode=dio
wifinfo.build.flash_freq=40

wifinfo.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
wifinfo.menu.eesz.1M64.build.flash_size=1M
wifinfo.menu.eesz.1M64.build.flash_size_arg=1MB
wifinfo.menu.eesz.1M64.upload.maximum_size=481280

wifinfo.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
wifinfo.menu.eesz.1M128.build.flash_size=1M
wifinfo.menu.eesz.1M128.build.flash_size_arg=1MB
wifinfo.menu.eesz.1M128.upload.maximum_size=448512

