alexCajas/esp8266RTOSArduCore/boards.txt
wifinfo.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
wifinfo.menu.eesz.1M256.build.flash_size=1M
wifinfo.menu.eesz.1M256.build.flash_size_arg=1MB
wifinfo.menu.eesz.1M256.upload.maximum_size=382976

wifinfo.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
wifinfo.menu.eesz.1M512.build.flash_size=1M
wifinfo.menu.eesz.1M512.build.flash_size_arg=1MB
wifinfo.menu.eesz.1M512.upload.maximum_size=251904

wifinfo.menu.eesz.1M=1MB (FS:none OTA:~502KB)
wifinfo.menu.eesz.1M.build.flash_size=1M
wifinfo.menu.eesz.1M.build.flash_size_arg=1MB
wifinfo.menu.eesz.1M.upload.maximum_size=514048

wifinfo.menu.xtal.80=80 MHz
wifinfo.menu.xtal.80.build.f_cpu=80000000L
wifinfo.menu.xtal.160=160 MHz
wifinfo.menu.xtal.160.build.f_cpu=160000000L

wifinfo.menu.lvl.None____=None
wifinfo.menu.lvl.None____.build.arduhal_log_level=0
wifinfo.menu.lvl.Error=Error
wifinfo.menu.lvl.Error.build.arduhal_log_level=1
wifinfo.menu.lvl.Warn=Warn
wifinfo.menu.lvl.Warn.build.arduhal_log_level=2
wifinfo.menu.lvl.Info=Info
wifinfo.menu.lvl.Info.build.arduhal_log_level=3
wifinfo.menu.lvl.Debug=Debug
wifinfo.menu.lvl.Debug.build.arduhal_log_level=4
wifinfo.menu.lvl.Verbose=Verbose
wifinfo.menu.lvl.Verbose.build.arduhal_log_level=5


# --- Olimex MOD-WIFI (2MB) ---
modwifi.name=Olimex MOD-WIFI
modwifi.build.board=ESP8266_MODWIFI
modwifi.build.mcu=esp8266
modwifi.build.core=esp8266
modwifi.build.variant=modwifi
modwifi.upload.tool=esptool
modwifi.upload.speed=115200
modwifi.upload.resetmethod=--before default_reset --after hard_reset
modwifi.build.flash_mode=qio
modwifi.build.flash_freq=40

modwifi.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
modwifi.menu.eesz.2M64.build.flash_size=2M
modwifi.menu.eesz.2M64.build.flash_size_arg=2MB
modwifi.menu.eesz.2M64.upload.maximum_size=1015808

modwifi.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
modwifi.menu.eesz.2M1M.build.flash_size=2M
modwifi.menu.eesz.2M1M.build.flash_size_arg=2MB
modwifi.menu.eesz.2M1M.upload.maximum_size=524288

modwifi.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
modwifi.menu.eesz.2M.build.flash_size=2M
modwifi.menu.eesz.2M.build.flash_size_arg=2MB
modwifi.menu.eesz.2M.upload.maximum_size=1043456

modwifi.menu.xtal.80=80 MHz
modwifi.menu.xtal.80.build.f_cpu=80000000L
modwifi.menu.xtal.160=160 MHz
modwifi.menu.xtal.160.build.f_cpu=160000000L

modwifi.menu.lvl.None____=None
modwifi.menu.lvl.None____.build.arduhal_log_level=0
modwifi.menu.lvl.Error=Error
modwifi.menu.lvl.Error.build.arduhal_log_level=1
modwifi.menu.lvl.Warn=Warn
modwifi.menu.lvl.Warn.build.arduhal_log_level=2
modwifi.menu.lvl.Info=Info
modwifi.menu.lvl.Info.build.arduhal_log_level=3
modwifi.menu.lvl.Debug=Debug
modwifi.menu.lvl.Debug.build.arduhal_log_level=4
modwifi.menu.lvl.Verbose=Verbose
modwifi.menu.lvl.Verbose.build.arduhal_log_level=5


# ==============================================================================
# 4. COMMUNITY 4MB BOARDS (Standard Template)
# ==============================================================================

# --- Definición Base y Variantes ---
d1.name=Wemos D1 R1
d1.build.variant=d1

espino.name=ESPino
espino.build.variant=espino

inventone.name=Invent One
inventone.build.variant=inventone

phoenix_v1.name=Phoenix 1.0
phoenix_v1.build.variant=phoenix_v1

agruminolemonv4.name=Agrumino Lemon v4
agruminolemonv4.build.variant=agruminolemonv4

eduinowifi.name=Eduino WiFi
eduinowifi.build.variant=eduinowifi

espinotee.name=ThaiEasyElec ESPino
espinotee.build.variant=espinotee

phoenix_v2.name=Phoenix 2.0
phoenix_v2.build.variant=phoenix_v2

wifio.name=Wifio
wifio.build.variant=wifio

arduino_spi.name=Arduino WiFi Shield (SPI)
arduino_spi.build.variant=arduino_spi

espresso_lite_v1.name=ESPresso Lite 1.0
espresso_lite_v1.build.variant=espresso_lite_v1

wifi_slot.name=Amperka WiFi Slot
wifi_slot.build.variant=wifi_slot

arduino_uart.name=Arduino WiFi Shield (UART)
arduino_uart.build.variant=arduino_uart

ESPDuino.name=ESPDuino
ESPDuino.build.variant=ESPDuino

espresso_lite_v2.name=ESPresso Lite 2.0
espresso_lite_v2.build.variant=espresso_lite_v2

wifiduino.name=Wifiduino
wifiduino.build.variant=wifiduino

wiolink.name=Seeed Wio Link
wiolink.build.variant=wiolink

espectro.name=Espectro Core
espectro.build.variant=espectro

oak.name=Digistump Oak
oak.build.variant=oak

wifi_kit_8.name=Heltec WiFi Kit 8
wifi_kit_8.build.variant=wifi_kit_8

xinabox.name=XinaBox CW01
xinabox.build.variant=xinabox

# --- Configuración de Compilador y Flasheo ---
d1.build.mcu=esp8266
espino.build.mcu=esp8266
inventone.build.mcu=esp8266
phoenix_v1.build.mcu=esp8266
agruminolemonv4.build.mcu=esp8266
eduinowifi.build.mcu=esp8266
espinotee.build.mcu=esp8266
phoenix_v2.build.mcu=esp8266
wifio.build.mcu=esp8266
arduino_spi.build.mcu=esp8266
espresso_lite_v1.build.mcu=esp8266
wifi_slot.build.mcu=esp8266
arduino_uart.build.mcu=esp8266
ESPDuino.build.mcu=esp8266
espresso_lite_v2.build.mcu=esp8266
wifiduino.build.mcu=esp8266
wiolink.build.mcu=esp8266
espectro.build.mcu=esp8266
oak.build.mcu=esp8266
wifi_kit_8.build.mcu=esp8266
xinabox.build.mcu=esp8266

d1.build.core=esp8266
espino.build.core=esp8266
inventone.build.core=esp8266
phoenix_v1.build.core=esp8266
agruminolemonv4.build.core=esp8266
eduinowifi.build.core=esp8266
espinotee.build.core=esp8266
phoenix_v2.build.core=esp8266
wifio.build.core=esp8266
arduino_spi.build.core=esp8266
espresso_lite_v1.build.core=esp8266
wifi_slot.build.core=esp8266
arduino_uart.build.core=esp8266
ESPDuino.build.core=esp8266
espresso_lite_v2.build.core=esp8266
wifiduino.build.core=esp8266
wiolink.build.core=esp8266
espectro.build.core=esp8266
oak.build.core=esp8266
wifi_kit_8.build.core=esp8266
xinabox.build.core=esp8266

d1.upload.tool=esptool
espino.upload.tool=esptool
inventone.upload.tool=esptool
phoenix_v1.upload.tool=esptool
agruminolemonv4.upload.tool=esptool
eduinowifi.upload.tool=esptool
espinotee.upload.tool=esptool
phoenix_v2.upload.tool=esptool
wifio.upload.tool=esptool
arduino_spi.upload.tool=esptool
espresso_lite_v1.upload.tool=esptool
wifi_slot.upload.tool=esptool
arduino_uart.upload.tool=esptool
ESPDuino.upload.tool=esptool
espresso_lite_v2.upload.tool=esptool
wifiduino.upload.tool=esptool
wiolink.upload.tool=esptool
espectro.upload.tool=esptool
oak.upload.tool=esptool
wifi_kit_8.upload.tool=esptool
xinabox.upload.tool=esptool

d1.build.flash_mode=dio
espino.build.flash_mode=dio
inventone.build.flash_mode=dio
phoenix_v1.build.flash_mode=dio
agruminolemonv4.build.flash_mode=dio
eduinowifi.build.flash_mode=dio
espinotee.build.flash_mode=dio
phoenix_v2.build.flash_mode=dio
wifio.build.flash_mode=dio
arduino_spi.build.flash_mode=dio
espresso_lite_v1.build.flash_mode=dio
wifi_slot.build.flash_mode=dio
arduino_uart.build.flash_mode=dio
ESPDuino.build.flash_mode=dio
espresso_lite_v2.build.flash_mode=dio
wifiduino.build.flash_mode=dio
wiolink.build.flash_mode=dio
espectro.build.flash_mode=dio
oak.build.flash_mode=dio
wifi_kit_8.build.flash_mode=dio
xinabox.build.flash_mode=dio

