alexCajas/esp8266RTOSArduCore/boards.txt
# --- FLASH SIZE MENU (4M2M, 4M3M, 4M1M, 4M) ---
d1.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
espino.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
inventone.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
phoenix_v1.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
agruminolemonv4.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
eduinowifi.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
espinotee.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
phoenix_v2.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
wifio.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
arduino_spi.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
espresso_lite_v1.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
wifi_slot.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
arduino_uart.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
ESPDuino.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
espresso_lite_v2.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
wifiduino.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
wiolink.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
espectro.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
oak.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
wifi_kit_8.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
xinabox.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)

d1.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
espino.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
inventone.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
phoenix_v1.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
agruminolemonv4.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
eduinowifi.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
espinotee.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
phoenix_v2.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
wifio.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
arduino_spi.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
espresso_lite_v1.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
wifi_slot.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
arduino_uart.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
ESPDuino.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
espresso_lite_v2.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
wifiduino.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
wiolink.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
espectro.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
oak.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
wifi_kit_8.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
xinabox.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)

d1.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
espino.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
inventone.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
phoenix_v1.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
agruminolemonv4.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
eduinowifi.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
espinotee.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
phoenix_v2.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
wifio.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
arduino_spi.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
espresso_lite_v1.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
wifi_slot.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
arduino_uart.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
ESPDuino.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
espresso_lite_v2.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
wifiduino.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
wiolink.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
espectro.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
oak.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
wifi_kit_8.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
xinabox.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)

d1.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
espino.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
inventone.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
phoenix_v1.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
agruminolemonv4.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
eduinowifi.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
espinotee.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
phoenix_v2.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
wifio.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
arduino_spi.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
espresso_lite_v1.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
wifi_slot.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
arduino_uart.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
ESPDuino.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
espresso_lite_v2.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
wifiduino.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
wiolink.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
espectro.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
oak.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
wifi_kit_8.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
xinabox.menu.eesz.4M=4MB (FS:none OTA:~1019KB)

# Parámetros internos de Flash Size
d1.menu.eesz.4M2M.build.flash_size=4M
espino.menu.eesz.4M2M.build.flash_size=4M
inventone.menu.eesz.4M2M.build.flash_size=4M
phoenix_v1.menu.eesz.4M2M.build.flash_size=4M
agruminolemonv4.menu.eesz.4M2M.build.flash_size=4M
eduinowifi.menu.eesz.4M2M.build.flash_size=4M
espinotee.menu.eesz.4M2M.build.flash_size=4M
phoenix_v2.menu.eesz.4M2M.build.flash_size=4M
wifio.menu.eesz.4M2M.build.flash_size=4M
arduino_spi.menu.eesz.4M2M.build.flash_size=4M
espresso_lite_v1.menu.eesz.4M2M.build.flash_size=4M
wifi_slot.menu.eesz.4M2M.build.flash_size=4M
arduino_uart.menu.eesz.4M2M.build.flash_size=4M
ESPDuino.menu.eesz.4M2M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M2M.build.flash_size=4M
wifiduino.menu.eesz.4M2M.build.flash_size=4M
wiolink.menu.eesz.4M2M.build.flash_size=4M
espectro.menu.eesz.4M2M.build.flash_size=4M
oak.menu.eesz.4M2M.build.flash_size=4M
wifi_kit_8.menu.eesz.4M2M.build.flash_size=4M
xinabox.menu.eesz.4M2M.build.flash_size=4M

d1.menu.eesz.4M3M.build.flash_size=4M
espino.menu.eesz.4M3M.build.flash_size=4M
inventone.menu.eesz.4M3M.build.flash_size=4M
phoenix_v1.menu.eesz.4M3M.build.flash_size=4M
agruminolemonv4.menu.eesz.4M3M.build.flash_size=4M
eduinowifi.menu.eesz.4M3M.build.flash_size=4M
espinotee.menu.eesz.4M3M.build.flash_size=4M
phoenix_v2.menu.eesz.4M3M.build.flash_size=4M
wifio.menu.eesz.4M3M.build.flash_size=4M
arduino_spi.menu.eesz.4M3M.build.flash_size=4M
espresso_lite_v1.menu.eesz.4M3M.build.flash_size=4M
wifi_slot.menu.eesz.4M3M.build.flash_size=4M
arduino_uart.menu.eesz.4M3M.build.flash_size=4M
ESPDuino.menu.eesz.4M3M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M3M.build.flash_size=4M
wifiduino.menu.eesz.4M3M.build.flash_size=4M
wiolink.menu.eesz.4M3M.build.flash_size=4M
espectro.menu.eesz.4M3M.build.flash_size=4M
oak.menu.eesz.4M3M.build.flash_size=4M
wifi_kit_8.menu.eesz.4M3M.build.flash_size=4M
xinabox.menu.eesz.4M3M.build.flash_size=4M

