alexCajas/esp8266RTOSArduCore/boards.txt
d1.menu.eesz.4M1M.build.flash_size=4M
espino.menu.eesz.4M1M.build.flash_size=4M
inventone.menu.eesz.4M1M.build.flash_size=4M
phoenix_v1.menu.eesz.4M1M.build.flash_size=4M
agruminolemonv4.menu.eesz.4M1M.build.flash_size=4M
eduinowifi.menu.eesz.4M1M.build.flash_size=4M
espinotee.menu.eesz.4M1M.build.flash_size=4M
phoenix_v2.menu.eesz.4M1M.build.flash_size=4M
wifio.menu.eesz.4M1M.build.flash_size=4M
arduino_spi.menu.eesz.4M1M.build.flash_size=4M
espresso_lite_v1.menu.eesz.4M1M.build.flash_size=4M
wifi_slot.menu.eesz.4M1M.build.flash_size=4M
arduino_uart.menu.eesz.4M1M.build.flash_size=4M
ESPDuino.menu.eesz.4M1M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M1M.build.flash_size=4M
wifiduino.menu.eesz.4M1M.build.flash_size=4M
wiolink.menu.eesz.4M1M.build.flash_size=4M
espectro.menu.eesz.4M1M.build.flash_size=4M
oak.menu.eesz.4M1M.build.flash_size=4M
wifi_kit_8.menu.eesz.4M1M.build.flash_size=4M
xinabox.menu.eesz.4M1M.build.flash_size=4M

d1.menu.eesz.4M.build.flash_size=4M
espino.menu.eesz.4M.build.flash_size=4M
inventone.menu.eesz.4M.build.flash_size=4M
phoenix_v1.menu.eesz.4M.build.flash_size=4M
agruminolemonv4.menu.eesz.4M.build.flash_size=4M
eduinowifi.menu.eesz.4M.build.flash_size=4M
espinotee.menu.eesz.4M.build.flash_size=4M
phoenix_v2.menu.eesz.4M.build.flash_size=4M
wifio.menu.eesz.4M.build.flash_size=4M
arduino_spi.menu.eesz.4M.build.flash_size=4M
espresso_lite_v1.menu.eesz.4M.build.flash_size=4M
wifi_slot.menu.eesz.4M.build.flash_size=4M
arduino_uart.menu.eesz.4M.build.flash_size=4M
ESPDuino.menu.eesz.4M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M.build.flash_size=4M
wifiduino.menu.eesz.4M.build.flash_size=4M
wiolink.menu.eesz.4M.build.flash_size=4M
espectro.menu.eesz.4M.build.flash_size=4M
oak.menu.eesz.4M.build.flash_size=4M
wifi_kit_8.menu.eesz.4M.build.flash_size=4M
xinabox.menu.eesz.4M.build.flash_size=4M

d1.menu.eesz.4M2M.build.flash_size_arg=4MB
espino.menu.eesz.4M2M.build.flash_size_arg=4MB
inventone.menu.eesz.4M2M.build.flash_size_arg=4MB
phoenix_v1.menu.eesz.4M2M.build.flash_size_arg=4MB
agruminolemonv4.menu.eesz.4M2M.build.flash_size_arg=4MB
eduinowifi.menu.eesz.4M2M.build.flash_size_arg=4MB
espinotee.menu.eesz.4M2M.build.flash_size_arg=4MB
phoenix_v2.menu.eesz.4M2M.build.flash_size_arg=4MB
wifio.menu.eesz.4M2M.build.flash_size_arg=4MB
arduino_spi.menu.eesz.4M2M.build.flash_size_arg=4MB
espresso_lite_v1.menu.eesz.4M2M.build.flash_size_arg=4MB
wifi_slot.menu.eesz.4M2M.build.flash_size_arg=4MB
arduino_uart.menu.eesz.4M2M.build.flash_size_arg=4MB
ESPDuino.menu.eesz.4M2M.build.flash_size_arg=4MB
espresso_lite_v2.menu.eesz.4M2M.build.flash_size_arg=4MB
wifiduino.menu.eesz.4M2M.build.flash_size_arg=4MB
wiolink.menu.eesz.4M2M.build.flash_size_arg=4MB
espectro.menu.eesz.4M2M.build.flash_size_arg=4MB
oak.menu.eesz.4M2M.build.flash_size_arg=4MB
wifi_kit_8.menu.eesz.4M2M.build.flash_size_arg=4MB
xinabox.menu.eesz.4M2M.build.flash_size_arg=4MB

d1.menu.eesz.4M3M.build.flash_size_arg=4MB
espino.menu.eesz.4M3M.build.flash_size_arg=4MB
inventone.menu.eesz.4M3M.build.flash_size_arg=4MB
phoenix_v1.menu.eesz.4M3M.build.flash_size_arg=4MB
agruminolemonv4.menu.eesz.4M3M.build.flash_size_arg=4MB
eduinowifi.menu.eesz.4M3M.build.flash_size_arg=4MB
espinotee.menu.eesz.4M3M.build.flash_size_arg=4MB
phoenix_v2.menu.eesz.4M3M.build.flash_size_arg=4MB
wifio.menu.eesz.4M3M.build.flash_size_arg=4MB
arduino_spi.menu.eesz.4M3M.build.flash_size_arg=4MB
espresso_lite_v1.menu.eesz.4M3M.build.flash_size_arg=4MB
wifi_slot.menu.eesz.4M3M.build.flash_size_arg=4MB
arduino_uart.menu.eesz.4M3M.build.flash_size_arg=4MB
ESPDuino.menu.eesz.4M3M.build.flash_size_arg=4MB
espresso_lite_v2.menu.eesz.4M3M.build.flash_size_arg=4MB
wifiduino.menu.eesz.4M3M.build.flash_size_arg=4MB
wiolink.menu.eesz.4M3M.build.flash_size_arg=4MB
espectro.menu.eesz.4M3M.build.flash_size_arg=4MB
oak.menu.eesz.4M3M.build.flash_size_arg=4MB
wifi_kit_8.menu.eesz.4M3M.build.flash_size_arg=4MB
xinabox.menu.eesz.4M3M.build.flash_size_arg=4MB

d1.menu.eesz.4M1M.build.flash_size_arg=4MB
espino.menu.eesz.4M1M.build.flash_size_arg=4MB
inventone.menu.eesz.4M1M.build.flash_size_arg=4MB
phoenix_v1.menu.eesz.4M1M.build.flash_size_arg=4MB
agruminolemonv4.menu.eesz.4M1M.build.flash_size_arg=4MB
eduinowifi.menu.eesz.4M1M.build.flash_size_arg=4MB
espinotee.menu.eesz.4M1M.build.flash_size_arg=4MB
phoenix_v2.menu.eesz.4M1M.build.flash_size_arg=4MB
wifio.menu.eesz.4M1M.build.flash_size_arg=4MB
arduino_spi.menu.eesz.4M1M.build.flash_size_arg=4MB
espresso_lite_v1.menu.eesz.4M1M.build.flash_size_arg=4MB
wifi_slot.menu.eesz.4M1M.build.flash_size_arg=4MB
arduino_uart.menu.eesz.4M1M.build.flash_size_arg=4MB
ESPDuino.menu.eesz.4M1M.build.flash_size_arg=4MB
espresso_lite_v2.menu.eesz.4M1M.build.flash_size_arg=4MB
wifiduino.menu.eesz.4M1M.build.flash_size_arg=4MB
wiolink.menu.eesz.4M1M.build.flash_size_arg=4MB
espectro.menu.eesz.4M1M.build.flash_size_arg=4MB
oak.menu.eesz.4M1M.build.flash_size_arg=4MB
wifi_kit_8.menu.eesz.4M1M.build.flash_size_arg=4MB
xinabox.menu.eesz.4M1M.build.flash_size_arg=4MB

d1.menu.eesz.4M.build.flash_size_arg=4MB
espino.menu.eesz.4M.build.flash_size_arg=4MB
inventone.menu.eesz.4M.build.flash_size_arg=4MB
phoenix_v1.menu.eesz.4M.build.flash_size_arg=4MB
agruminolemonv4.menu.eesz.4M.build.flash_size_arg=4MB
eduinowifi.menu.eesz.4M.build.flash_size_arg=4MB
espinotee.menu.eesz.4M.build.flash_size_arg=4MB
phoenix_v2.menu.eesz.4M.build.flash_size_arg=4MB
wifio.menu.eesz.4M.build.flash_size_arg=4MB
arduino_spi.menu.eesz.4M.build.flash_size_arg=4MB
espresso_lite_v1.menu.eesz.4M.build.flash_size_arg=4MB
wifi_slot.menu.eesz.4M.build.flash_size_arg=4MB
arduino_uart.menu.eesz.4M.build.flash_size_arg=4MB
ESPDuino.menu.eesz.4M.build.flash_size_arg=4MB
espresso_lite_v2.menu.eesz.4M.build.flash_size_arg=4MB
wifiduino.menu.eesz.4M.build.flash_size_arg=4MB
wiolink.menu.eesz.4M.build.flash_size_arg=4MB
espectro.menu.eesz.4M.build.flash_size_arg=4MB
oak.menu.eesz.4M.build.flash_size_arg=4MB
wifi_kit_8.menu.eesz.4M.build.flash_size_arg=4MB
xinabox.menu.eesz.4M.build.flash_size_arg=4MB

d1.menu.eesz.4M2M.upload.maximum_size=1043456
espino.menu.eesz.4M2M.upload.maximum_size=1043456
inventone.menu.eesz.4M2M.upload.maximum_size=1043456
phoenix_v1.menu.eesz.4M2M.upload.maximum_size=1043456
agruminolemonv4.menu.eesz.4M2M.upload.maximum_size=1043456
eduinowifi.menu.eesz.4M2M.upload.maximum_size=1043456
espinotee.menu.eesz.4M2M.upload.maximum_size=1043456
phoenix_v2.menu.eesz.4M2M.upload.maximum_size=1043456
wifio.menu.eesz.4M2M.upload.maximum_size=1043456
arduino_spi.menu.eesz.4M2M.upload.maximum_size=1043456
espresso_lite_v1.menu.eesz.4M2M.upload.maximum_size=1043456
wifi_slot.menu.eesz.4M2M.upload.maximum_size=1043456
arduino_uart.menu.eesz.4M2M.upload.maximum_size=1043456
ESPDuino.menu.eesz.4M2M.upload.maximum_size=1043456
espresso_lite_v2.menu.eesz.4M2M.upload.maximum_size=1043456
wifiduino.menu.eesz.4M2M.upload.maximum_size=1043456
wiolink.menu.eesz.4M2M.upload.maximum_size=1043456
espectro.menu.eesz.4M2M.upload.maximum_size=1043456
oak.menu.eesz.4M2M.upload.maximum_size=1043456
wifi_kit_8.menu.eesz.4M2M.upload.maximum_size=1043456
xinabox.menu.eesz.4M2M.upload.maximum_size=1043456

d1.menu.eesz.4M3M.upload.maximum_size=524288
espino.menu.eesz.4M3M.upload.maximum_size=524288
inventone.menu.eesz.4M3M.upload.maximum_size=524288
phoenix_v1.menu.eesz.4M3M.upload.maximum_size=524288
agruminolemonv4.menu.eesz.4M3M.upload.maximum_size=524288
eduinowifi.menu.eesz.4M3M.upload.maximum_size=524288
espinotee.menu.eesz.4M3M.upload.maximum_size=524288
phoenix_v2.menu.eesz.4M3M.upload.maximum_size=524288
wifio.menu.eesz.4M3M.upload.maximum_size=524288
arduino_spi.menu.eesz.4M3M.upload.maximum_size=524288
espresso_lite_v1.menu.eesz.4M3M.upload.maximum_size=524288
wifi_slot.menu.eesz.4M3M.upload.maximum_size=524288
arduino_uart.menu.eesz.4M3M.upload.maximum_size=524288
ESPDuino.menu.eesz.4M3M.upload.maximum_size=524288
espresso_lite_v2.menu.eesz.4M3M.upload.maximum_size=524288
wifiduino.menu.eesz.4M3M.upload.maximum_size=524288
wiolink.menu.eesz.4M3M.upload.maximum_size=524288
espectro.menu.eesz.4M3M.upload.maximum_size=524288
oak.menu.eesz.4M3M.upload.maximum_size=524288
wifi_kit_8.menu.eesz.4M3M.upload.maximum_size=524288
xinabox.menu.eesz.4M3M.upload.maximum_size=524288

d1.menu.eesz.4M1M.upload.maximum_size=1043456
espino.menu.eesz.4M1M.upload.maximum_size=1043456
inventone.menu.eesz.4M1M.upload.maximum_size=1043456
phoenix_v1.menu.eesz.4M1M.upload.maximum_size=1043456
agruminolemonv4.menu.eesz.4M1M.upload.maximum_size=1043456
eduinowifi.menu.eesz.4M1M.upload.maximum_size=1043456
espinotee.menu.eesz.4M1M.upload.maximum_size=1043456
phoenix_v2.menu.eesz.4M1M.upload.maximum_size=1043456
wifio.menu.eesz.4M1M.upload.maximum_size=1043456
arduino_spi.menu.eesz.4M1M.upload.maximum_size=1043456
espresso_lite_v1.menu.eesz.4M1M.upload.maximum_size=1043456
wifi_slot.menu.eesz.4M1M.upload.maximum_size=1043456
arduino_uart.menu.eesz.4M1M.upload.maximum_size=1043456
ESPDuino.menu.eesz.4M1M.upload.maximum_size=1043456
espresso_lite_v2.menu.eesz.4M1M.upload.maximum_size=1043456
wifiduino.menu.eesz.4M1M.upload.maximum_size=1043456
wiolink.menu.eesz.4M1M.upload.maximum_size=1043456
espectro.menu.eesz.4M1M.upload.maximum_size=1043456
oak.menu.eesz.4M1M.upload.maximum_size=1043456
wifi_kit_8.menu.eesz.4M1M.upload.maximum_size=1043456
xinabox.menu.eesz.4M1M.upload.maximum_size=1043456

d1.menu.eesz.4M.upload.maximum_size=1043456
espino.menu.eesz.4M.upload.maximum_size=1043456
inventone.menu.eesz.4M.upload.maximum_size=1043456
phoenix_v1.menu.eesz.4M.upload.maximum_size=1043456
agruminolemonv4.menu.eesz.4M.upload.maximum_size=1043456
eduinowifi.menu.eesz.4M.upload.maximum_size=1043456
espinotee.menu.eesz.4M.upload.maximum_size=1043456
phoenix_v2.menu.eesz.4M.upload.maximum_size=1043456
wifio.menu.eesz.4M.upload.maximum_size=1043456
arduino_spi.menu.eesz.4M.upload.maximum_size=1043456
espresso_lite_v1.menu.eesz.4M.upload.maximum_size=1043456
wifi_slot.menu.eesz.4M.upload.maximum_size=1043456
arduino_uart.menu.eesz.4M.upload.maximum_size=1043456
ESPDuino.menu.eesz.4M.upload.maximum_size=1043456
espresso_lite_v2.menu.eesz.4M.upload.maximum_size=1043456
wifiduino.menu.eesz.4M.upload.maximum_size=1043456
wiolink.menu.eesz.4M.upload.maximum_size=1043456
espectro.menu.eesz.4M.upload.maximum_size=1043456
oak.menu.eesz.4M.upload.maximum_size=1043456
wifi_kit_8.menu.eesz.4M.upload.maximum_size=1043456
xinabox.menu.eesz.4M.upload.maximum_size=1043456

# --- CPU Freq (80, 160) ---
d1.menu.xtal.80=80 MHz
espino.menu.xtal.80=80 MHz
inventone.menu.xtal.80=80 MHz
phoenix_v1.menu.xtal.80=80 MHz
agruminolemonv4.menu.xtal.80=80 MHz
eduinowifi.menu.xtal.80=80 MHz
espinotee.menu.xtal.80=80 MHz
phoenix_v2.menu.xtal.80=80 MHz
wifio.menu.xtal.80=80 MHz
arduino_spi.menu.xtal.80=80 MHz
espresso_lite_v1.menu.xtal.80=80 MHz
wifi_slot.menu.xtal.80=80 MHz
arduino_uart.menu.xtal.80=80 MHz
ESPDuino.menu.xtal.80=80 MHz
espresso_lite_v2.menu.xtal.80=80 MHz
wifiduino.menu.xtal.80=80 MHz
wiolink.menu.xtal.80=80 MHz
espectro.menu.xtal.80=80 MHz
oak.menu.xtal.80=80 MHz
wifi_kit_8.menu.xtal.80=80 MHz
xinabox.menu.xtal.80=80 MHz

