alexCajas/esp8266RTOSArduCore/boards.txt
d1.menu.xtal.160=160 MHz
espino.menu.xtal.160=160 MHz
inventone.menu.xtal.160=160 MHz
phoenix_v1.menu.xtal.160=160 MHz
agruminolemonv4.menu.xtal.160=160 MHz
eduinowifi.menu.xtal.160=160 MHz
espinotee.menu.xtal.160=160 MHz
phoenix_v2.menu.xtal.160=160 MHz
wifio.menu.xtal.160=160 MHz
arduino_spi.menu.xtal.160=160 MHz
espresso_lite_v1.menu.xtal.160=160 MHz
wifi_slot.menu.xtal.160=160 MHz
arduino_uart.menu.xtal.160=160 MHz
ESPDuino.menu.xtal.160=160 MHz
espresso_lite_v2.menu.xtal.160=160 MHz
wifiduino.menu.xtal.160=160 MHz
wiolink.menu.xtal.160=160 MHz
espectro.menu.xtal.160=160 MHz
oak.menu.xtal.160=160 MHz
wifi_kit_8.menu.xtal.160=160 MHz
xinabox.menu.xtal.160=160 MHz

d1.menu.xtal.80.build.f_cpu=80000000L
espino.menu.xtal.80.build.f_cpu=80000000L
inventone.menu.xtal.80.build.f_cpu=80000000L
phoenix_v1.menu.xtal.80.build.f_cpu=80000000L
agruminolemonv4.menu.xtal.80.build.f_cpu=80000000L
eduinowifi.menu.xtal.80.build.f_cpu=80000000L
espinotee.menu.xtal.80.build.f_cpu=80000000L
phoenix_v2.menu.xtal.80.build.f_cpu=80000000L
wifio.menu.xtal.80.build.f_cpu=80000000L
arduino_spi.menu.xtal.80.build.f_cpu=80000000L
espresso_lite_v1.menu.xtal.80.build.f_cpu=80000000L
wifi_slot.menu.xtal.80.build.f_cpu=80000000L
arduino_uart.menu.xtal.80.build.f_cpu=80000000L
ESPDuino.menu.xtal.80.build.f_cpu=80000000L
espresso_lite_v2.menu.xtal.80.build.f_cpu=80000000L
wifiduino.menu.xtal.80.build.f_cpu=80000000L
wiolink.menu.xtal.80.build.f_cpu=80000000L
espectro.menu.xtal.80.build.f_cpu=80000000L
oak.menu.xtal.80.build.f_cpu=80000000L
wifi_kit_8.menu.xtal.80.build.f_cpu=80000000L
xinabox.menu.xtal.80.build.f_cpu=80000000L

d1.menu.xtal.160.build.f_cpu=160000000L
espino.menu.xtal.160.build.f_cpu=160000000L
inventone.menu.xtal.160.build.f_cpu=160000000L
phoenix_v1.menu.xtal.160.build.f_cpu=160000000L
agruminolemonv4.menu.xtal.160.build.f_cpu=160000000L
eduinowifi.menu.xtal.160.build.f_cpu=160000000L
espinotee.menu.xtal.160.build.f_cpu=160000000L
phoenix_v2.menu.xtal.160.build.f_cpu=160000000L
wifio.menu.xtal.160.build.f_cpu=160000000L
arduino_spi.menu.xtal.160.build.f_cpu=160000000L
espresso_lite_v1.menu.xtal.160.build.f_cpu=160000000L
wifi_slot.menu.xtal.160.build.f_cpu=160000000L
arduino_uart.menu.xtal.160.build.f_cpu=160000000L
ESPDuino.menu.xtal.160.build.f_cpu=160000000L
espresso_lite_v2.menu.xtal.160.build.f_cpu=160000000L
wifiduino.menu.xtal.160.build.f_cpu=160000000L
wiolink.menu.xtal.160.build.f_cpu=160000000L
espectro.menu.xtal.160.build.f_cpu=160000000L
oak.menu.xtal.160.build.f_cpu=160000000L
wifi_kit_8.menu.xtal.160.build.f_cpu=160000000L
xinabox.menu.xtal.160.build.f_cpu=160000000L

# --- Log Levels (0 to 5) ---
d1.menu.lvl.None____=None
espino.menu.lvl.None____=None
inventone.menu.lvl.None____=None
phoenix_v1.menu.lvl.None____=None
agruminolemonv4.menu.lvl.None____=None
eduinowifi.menu.lvl.None____=None
espinotee.menu.lvl.None____=None
phoenix_v2.menu.lvl.None____=None
wifio.menu.lvl.None____=None
arduino_spi.menu.lvl.None____=None
espresso_lite_v1.menu.lvl.None____=None
wifi_slot.menu.lvl.None____=None
arduino_uart.menu.lvl.None____=None
ESPDuino.menu.lvl.None____=None
espresso_lite_v2.menu.lvl.None____=None
wifiduino.menu.lvl.None____=None
wiolink.menu.lvl.None____=None
espectro.menu.lvl.None____=None
oak.menu.lvl.None____=None
wifi_kit_8.menu.lvl.None____=None
xinabox.menu.lvl.None____=None

d1.menu.lvl.Error=Error
espino.menu.lvl.Error=Error
inventone.menu.lvl.Error=Error
phoenix_v1.menu.lvl.Error=Error
agruminolemonv4.menu.lvl.Error=Error
eduinowifi.menu.lvl.Error=Error
espinotee.menu.lvl.Error=Error
phoenix_v2.menu.lvl.Error=Error
wifio.menu.lvl.Error=Error
arduino_spi.menu.lvl.Error=Error
espresso_lite_v1.menu.lvl.Error=Error
wifi_slot.menu.lvl.Error=Error
arduino_uart.menu.lvl.Error=Error
ESPDuino.menu.lvl.Error=Error
espresso_lite_v2.menu.lvl.Error=Error
wifiduino.menu.lvl.Error=Error
wiolink.menu.lvl.Error=Error
espectro.menu.lvl.Error=Error
oak.menu.lvl.Error=Error
wifi_kit_8.menu.lvl.Error=Error
xinabox.menu.lvl.Error=Error

d1.menu.lvl.Warn=Warn
espino.menu.lvl.Warn=Warn
inventone.menu.lvl.Warn=Warn
phoenix_v1.menu.lvl.Warn=Warn
agruminolemonv4.menu.lvl.Warn=Warn
eduinowifi.menu.lvl.Warn=Warn
espinotee.menu.lvl.Warn=Warn
phoenix_v2.menu.lvl.Warn=Warn
wifio.menu.lvl.Warn=Warn
arduino_spi.menu.lvl.Warn=Warn
espresso_lite_v1.menu.lvl.Warn=Warn
wifi_slot.menu.lvl.Warn=Warn
arduino_uart.menu.lvl.Warn=Warn
ESPDuino.menu.lvl.Warn=Warn
espresso_lite_v2.menu.lvl.Warn=Warn
wifiduino.menu.lvl.Warn=Warn
wiolink.menu.lvl.Warn=Warn
espectro.menu.lvl.Warn=Warn
oak.menu.lvl.Warn=Warn
wifi_kit_8.menu.lvl.Warn=Warn
xinabox.menu.lvl.Warn=Warn

d1.menu.lvl.Info=Info
espino.menu.lvl.Info=Info
inventone.menu.lvl.Info=Info
phoenix_v1.menu.lvl.Info=Info
agruminolemonv4.menu.lvl.Info=Info
eduinowifi.menu.lvl.Info=Info
espinotee.menu.lvl.Info=Info
phoenix_v2.menu.lvl.Info=Info
wifio.menu.lvl.Info=Info
arduino_spi.menu.lvl.Info=Info
espresso_lite_v1.menu.lvl.Info=Info
wifi_slot.menu.lvl.Info=Info
arduino_uart.menu.lvl.Info=Info
ESPDuino.menu.lvl.Info=Info
espresso_lite_v2.menu.lvl.Info=Info
wifiduino.menu.lvl.Info=Info
wiolink.menu.lvl.Info=Info
espectro.menu.lvl.Info=Info
oak.menu.lvl.Info=Info
wifi_kit_8.menu.lvl.Info=Info
xinabox.menu.lvl.Info=Info

d1.menu.lvl.Debug=Debug
espino.menu.lvl.Debug=Debug
inventone.menu.lvl.Debug=Debug
phoenix_v1.menu.lvl.Debug=Debug
agruminolemonv4.menu.lvl.Debug=Debug
eduinowifi.menu.lvl.Debug=Debug
espinotee.menu.lvl.Debug=Debug
phoenix_v2.menu.lvl.Debug=Debug
wifio.menu.lvl.Debug=Debug
arduino_spi.menu.lvl.Debug=Debug
espresso_lite_v1.menu.lvl.Debug=Debug
wifi_slot.menu.lvl.Debug=Debug
arduino_uart.menu.lvl.Debug=Debug
ESPDuino.menu.lvl.Debug=Debug
espresso_lite_v2.menu.lvl.Debug=Debug
wifiduino.menu.lvl.Debug=Debug
wiolink.menu.lvl.Debug=Debug
espectro.menu.lvl.Debug=Debug
oak.menu.lvl.Debug=Debug
wifi_kit_8.menu.lvl.Debug=Debug
xinabox.menu.lvl.Debug=Debug

d1.menu.lvl.Verbose=Verbose
espino.menu.lvl.Verbose=Verbose
inventone.menu.lvl.Verbose=Verbose
phoenix_v1.menu.lvl.Verbose=Verbose
agruminolemonv4.menu.lvl.Verbose=Verbose
eduinowifi.menu.lvl.Verbose=Verbose
espinotee.menu.lvl.Verbose=Verbose
phoenix_v2.menu.lvl.Verbose=Verbose
wifio.menu.lvl.Verbose=Verbose
arduino_spi.menu.lvl.Verbose=Verbose
espresso_lite_v1.menu.lvl.Verbose=Verbose
wifi_slot.menu.lvl.Verbose=Verbose
arduino_uart.menu.lvl.Verbose=Verbose
ESPDuino.menu.lvl.Verbose=Verbose
espresso_lite_v2.menu.lvl.Verbose=Verbose
wifiduino.menu.lvl.Verbose=Verbose
wiolink.menu.lvl.Verbose=Verbose
espectro.menu.lvl.Verbose=Verbose
oak.menu.lvl.Verbose=Verbose
wifi_kit_8.menu.lvl.Verbose=Verbose
xinabox.menu.lvl.Verbose=Verbose

d1.menu.lvl.None____.build.arduhal_log_level=0
espino.menu.lvl.None____.build.arduhal_log_level=0
inventone.menu.lvl.None____.build.arduhal_log_level=0
phoenix_v1.menu.lvl.None____.build.arduhal_log_level=0
agruminolemonv4.menu.lvl.None____.build.arduhal_log_level=0
eduinowifi.menu.lvl.None____.build.arduhal_log_level=0
espinotee.menu.lvl.None____.build.arduhal_log_level=0
phoenix_v2.menu.lvl.None____.build.arduhal_log_level=0
wifio.menu.lvl.None____.build.arduhal_log_level=0
arduino_spi.menu.lvl.None____.build.arduhal_log_level=0
espresso_lite_v1.menu.lvl.None____.build.arduhal_log_level=0
wifi_slot.menu.lvl.None____.build.arduhal_log_level=0
arduino_uart.menu.lvl.None____.build.arduhal_log_level=0
ESPDuino.menu.lvl.None____.build.arduhal_log_level=0
espresso_lite_v2.menu.lvl.None____.build.arduhal_log_level=0
wifiduino.menu.lvl.None____.build.arduhal_log_level=0
wiolink.menu.lvl.None____.build.arduhal_log_level=0
espectro.menu.lvl.None____.build.arduhal_log_level=0
oak.menu.lvl.None____.build.arduhal_log_level=0
wifi_kit_8.menu.lvl.None____.build.arduhal_log_level=0
xinabox.menu.lvl.None____.build.arduhal_log_level=0

d1.menu.lvl.Error.build.arduhal_log_level=1
espino.menu.lvl.Error.build.arduhal_log_level=1
inventone.menu.lvl.Error.build.arduhal_log_level=1
phoenix_v1.menu.lvl.Error.build.arduhal_log_level=1
agruminolemonv4.menu.lvl.Error.build.arduhal_log_level=1
eduinowifi.menu.lvl.Error.build.arduhal_log_level=1
espinotee.menu.lvl.Error.build.arduhal_log_level=1
phoenix_v2.menu.lvl.Error.build.arduhal_log_level=1
wifio.menu.lvl.Error.build.arduhal_log_level=1
arduino_spi.menu.lvl.Error.build.arduhal_log_level=1
espresso_lite_v1.menu.lvl.Error.build.arduhal_log_level=1
wifi_slot.menu.lvl.Error.build.arduhal_log_level=1
arduino_uart.menu.lvl.Error.build.arduhal_log_level=1
ESPDuino.menu.lvl.Error.build.arduhal_log_level=1
espresso_lite_v2.menu.lvl.Error.build.arduhal_log_level=1
wifiduino.menu.lvl.Error.build.arduhal_log_level=1
wiolink.menu.lvl.Error.build.arduhal_log_level=1
espectro.menu.lvl.Error.build.arduhal_log_level=1
oak.menu.lvl.Error.build.arduhal_log_level=1
wifi_kit_8.menu.lvl.Error.build.arduhal_log_level=1
xinabox.menu.lvl.Error.build.arduhal_log_level=1

