alexCajas/esp8266RTOSArduCore/boards.txt
d1.menu.lvl.Warn.build.arduhal_log_level=2
espino.menu.lvl.Warn.build.arduhal_log_level=2
inventone.menu.lvl.Warn.build.arduhal_log_level=2
phoenix_v1.menu.lvl.Warn.build.arduhal_log_level=2
agruminolemonv4.menu.lvl.Warn.build.arduhal_log_level=2
eduinowifi.menu.lvl.Warn.build.arduhal_log_level=2
espinotee.menu.lvl.Warn.build.arduhal_log_level=2
phoenix_v2.menu.lvl.Warn.build.arduhal_log_level=2
wifio.menu.lvl.Warn.build.arduhal_log_level=2
arduino_spi.menu.lvl.Warn.build.arduhal_log_level=2
espresso_lite_v1.menu.lvl.Warn.build.arduhal_log_level=2
wifi_slot.menu.lvl.Warn.build.arduhal_log_level=2
arduino_uart.menu.lvl.Warn.build.arduhal_log_level=2
ESPDuino.menu.lvl.Warn.build.arduhal_log_level=2
espresso_lite_v2.menu.lvl.Warn.build.arduhal_log_level=2
wifiduino.menu.lvl.Warn.build.arduhal_log_level=2
wiolink.menu.lvl.Warn.build.arduhal_log_level=2
espectro.menu.lvl.Warn.build.arduhal_log_level=2
oak.menu.lvl.Warn.build.arduhal_log_level=2
wifi_kit_8.menu.lvl.Warn.build.arduhal_log_level=2
xinabox.menu.lvl.Warn.build.arduhal_log_level=2

d1.menu.lvl.Info.build.arduhal_log_level=3
espino.menu.lvl.Info.build.arduhal_log_level=3
inventone.menu.lvl.Info.build.arduhal_log_level=3
phoenix_v1.menu.lvl.Info.build.arduhal_log_level=3
agruminolemonv4.menu.lvl.Info.build.arduhal_log_level=3
eduinowifi.menu.lvl.Info.build.arduhal_log_level=3
espinotee.menu.lvl.Info.build.arduhal_log_level=3
phoenix_v2.menu.lvl.Info.build.arduhal_log_level=3
wifio.menu.lvl.Info.build.arduhal_log_level=3
arduino_spi.menu.lvl.Info.build.arduhal_log_level=3
espresso_lite_v1.menu.lvl.Info.build.arduhal_log_level=3
wifi_slot.menu.lvl.Info.build.arduhal_log_level=3
arduino_uart.menu.lvl.Info.build.arduhal_log_level=3
ESPDuino.menu.lvl.Info.build.arduhal_log_level=3
espresso_lite_v2.menu.lvl.Info.build.arduhal_log_level=3
wifiduino.menu.lvl.Info.build.arduhal_log_level=3
wiolink.menu.lvl.Info.build.arduhal_log_level=3
espectro.menu.lvl.Info.build.arduhal_log_level=3
oak.menu.lvl.Info.build.arduhal_log_level=3
wifi_kit_8.menu.lvl.Info.build.arduhal_log_level=3
xinabox.menu.lvl.Info.build.arduhal_log_level=3

d1.menu.lvl.Debug.build.arduhal_log_level=4
espino.menu.lvl.Debug.build.arduhal_log_level=4
inventone.menu.lvl.Debug.build.arduhal_log_level=4
phoenix_v1.menu.lvl.Debug.build.arduhal_log_level=4
agruminolemonv4.menu.lvl.Debug.build.arduhal_log_level=4
eduinowifi.menu.lvl.Debug.build.arduhal_log_level=4
espinotee.menu.lvl.Debug.build.arduhal_log_level=4
phoenix_v2.menu.lvl.Debug.build.arduhal_log_level=4
wifio.menu.lvl.Debug.build.arduhal_log_level=4
arduino_spi.menu.lvl.Debug.build.arduhal_log_level=4
espresso_lite_v1.menu.lvl.Debug.build.arduhal_log_level=4
wifi_slot.menu.lvl.Debug.build.arduhal_log_level=4
arduino_uart.menu.lvl.Debug.build.arduhal_log_level=4
ESPDuino.menu.lvl.Debug.build.arduhal_log_level=4
espresso_lite_v2.menu.lvl.Debug.build.arduhal_log_level=4
wifiduino.menu.lvl.Debug.build.arduhal_log_level=4
wiolink.menu.lvl.Debug.build.arduhal_log_level=4
espectro.menu.lvl.Debug.build.arduhal_log_level=4
oak.menu.lvl.Debug.build.arduhal_log_level=4
wifi_kit_8.menu.lvl.Debug.build.arduhal_log_level=4
xinabox.menu.lvl.Debug.build.arduhal_log_level=4

d1.menu.lvl.Verbose.build.arduhal_log_level=5
espino.menu.lvl.Verbose.build.arduhal_log_level=5
inventone.menu.lvl.Verbose.build.arduhal_log_level=5
phoenix_v1.menu.lvl.Verbose.build.arduhal_log_level=5
agruminolemonv4.menu.lvl.Verbose.build.arduhal_log_level=5
eduinowifi.menu.lvl.Verbose.build.arduhal_log_level=5
espinotee.menu.lvl.Verbose.build.arduhal_log_level=5
phoenix_v2.menu.lvl.Verbose.build.arduhal_log_level=5
wifio.menu.lvl.Verbose.build.arduhal_log_level=5
arduino_spi.menu.lvl.Verbose.build.arduhal_log_level=5
espresso_lite_v1.menu.lvl.Verbose.build.arduhal_log_level=5
wifi_slot.menu.lvl.Verbose.build.arduhal_log_level=5
arduino_uart.menu.lvl.Verbose.build.arduhal_log_level=5
ESPDuino.menu.lvl.Verbose.build.arduhal_log_level=5
espresso_lite_v2.menu.lvl.Verbose.build.arduhal_log_level=5
wifiduino.menu.lvl.Verbose.build.arduhal_log_level=5
wiolink.menu.lvl.Verbose.build.arduhal_log_level=5
espectro.menu.lvl.Verbose.build.arduhal_log_level=5
oak.menu.lvl.Verbose.build.arduhal_log_level=5
wifi_kit_8.menu.lvl.Verbose.build.arduhal_log_level=5
xinabox.menu.lvl.Verbose.build.arduhal_log_level=5